"""

"""
CONSTRUCTIONS = {
    1: ['Triangle; ort; ort',
        'Треугольник ABC, в котором проведены две высоты СМ и ВН. Тогда вокруг четырёхугольника ВМСН можно описать окружность, причём ВС является диаметром. На хорду ВС'
        ' опираются два равных угла, поэтому четырёхугольник описанный. Хорда, на которую опирается прямой вписанный угол является диаметром'
        ],
    2: ['Circle; Line; SetValue',
        'Отметьте вспомогательную точку С на окружности и достройте до треугольника АВС. Примените теорему синусов или теорему о хорде и касательной'
        ],
    3: ['OrtTriangle; mdp',
        'Воспользуйтесь свойствами медианы прямоугольного треугольника, проведённой к гипотенузе. Примените приём удвоения медианы и достроения треугольника до параллелограмма'
        ],
    4: ['mdp; mdp',
        'Вспомните про среднюю линию и её свойства: параллельность стороне, о разделении треугольника на подобные с коэффициентом 1/2'
        ],
    5: ['Circle; Circle; Line; ort; cir',
        'Свойства двух окружностей, имеющих одну общую точку касания. Свойства точки пересечения двух касательных. Окружность, описанная около треугольника'
        'отрезков касательных'
        ],
    6: ['Line; ort; SetValue',
        'Найдите четырёхугольник, можно ли сделать вывод о том, что сумма противоположных углов равна 180 градусам? Если вокруг четырёхугольника можно '
        'описать окружность, то обратите внимание на углы, которые опираются на один отрезок с одной стороны.'
        ],
    7: ['prl; eqr',
        'Воспользуйтесь теоремой Фалеса.'
        ],
    8: ['inter; Triangle',
        'Центр вписанной окружности треугольника лежит в точки пересечения биссектрис. Стороны треугольника для вписанной окружности являются касательными,'
        'поэтому отрезки к точкам касания равны.'
        ],
    9: ['cyl; Circle; ort',
        'Обратите внимание на углы, опирающиеся на равные (одинаковые) отрезки. Угол между хордой и касательной равен вписанному углу, '
        'опирающемуся на эту хорду. Возможно Вам стоит воспользоваться методом линейных углов (активируйте соответствующую настройку)'
        ],
    10: ['eqa; Triangle; eqa; cir',
        'Возможно вы имеете дело с конструкцией: лемма о трезубце.'
        ],
    11: ['prl; prl; eql',
        'Если вы имеете дело с трапецией, то обратите внимание на дополнительные построения: перенос боковой стороны, отметить на малом основании такую точку,'
        'что выделит в трапеции параллелограмм.'
        ],
    12: ['eqr; eql; eqa; eqa; Triangle',
        'Примените метод вспомогательных подобных треугольников. Воспользуйтесь соотношением их площадей.'
        ],

}