"""
Номер Тип Текст Вопрос Источник Сложность Пр. форма условия Пр. форма вопроса Оценки решения 1-6 (см. ниже) Что проверяет (опц)

Тип: чисто доказательный / док-во с вычислениями
_________________________________________________________
Метрики оценки КАЧЕСТВА РЕШЕНИЯ (задачи тестового набора делятся на чисто-доказательные, вопрос с вычислением, и где вопрос на док-во, но без вычислений не обойтись)
(также делятся на задачи 1 и 2 части - для них тоже проводится сравнение).
1. [ЗАВЕРШЕННОСТЬ]d1 - сколько необходимых шагов к решения было сделано из общего кол-ва в человеческом.
2. [ИНТЕРПРЕТИРУЕМОСТЬ]d2% - оценка качества ТЕКСТА(связность, понятность) решения.
3. [ПОЛНОТА]d3 - (глубина исследования) обнаруженные предикаты программой / все предикаты были ли обнаружены из возможных при включенной настройке.
4. [СКОРОСТЬ]d4 - время выполнения задачи / стандартное время выполнения.
5. [ПОСТРОЕНИЕ АНАЛОГИЙ]d5% - насколько рекомендованные конструкции помогают в решении / какие похожие задачи в помощь подбирает модель
6. [СХОДИМОСТЬ]d6 = t/h; t - количество итераций / h - насколько глубокое решение (определяется глубиной дерева-графа решения)

1, 3, 4, 6 - описывают дедуктивный модуль. 2 - декоратор, 5 - образовательный. (субъективные) оценки
[1, 'В окружности с центром O проведена хорда AB, на которой выбрана точка M.'
                                    ' Вторая окружность, описанная около треугольника MAO, повторно пересекает первую окружность в точке K. Докажите, что BM = MK.', 'ЕГЭ',
                                 4, 'cyl(A, M, O, K), Circle(O, A, B, K), Line(A, M, B)', '[AB, BK] = [MK, BK]', 1, 0.7, 0.96, 0.45]
"""

import pandas as pd
demoDB = pd.read_csv(r'C:\Users\User\PycharmProjects\neurogeometry\algorithm\resources\demodf.csv')
#
# demoDB = pd.DataFrame(columns=['Тип', 'Текст', 'Источник', 'Сложность', 'Пр. форма условия', 'Пр. форма вопроса', 'Завершённость', 'Полнота', 'Скорость', 'Построение аналогий'])
# demoDB.index.name = 'Номера задач'
input_lst = [2, 1, 'В прямоугольном треугольнике АВС, М - середина гипотенузы, а Е - середина ВС. Докажите, что МЕ перпендикулярно ВС', 'ОГЭ',
                                 2, 'Triangle(A, B, C); ort(A, C, C, B); mdp(M, A, B); Line(C, M); Line(E, C, B); Line(M, E); mdp(E, C, B)', 'ort(M, E, B, C)', 1, 0.9, 0.98, 0.55]
print(len(input_lst))
demoDB.loc[len(demoDB.index)] = input_lst

demoDB.to_csv(r'C:\Users\User\PycharmProjects\neurogeometry\algorithm\resources\demodf.csv', encoding='utf-8')